In [1]:
# Get working directory
import os
os.getcwd()

'C:\\Users\\15431\\Desktop'

In [2]:
import numpy as np
import pandas as pd

In [3]:
url = "bank01\client.csv"
client_df = pd.read_csv(url)

In [4]:
client_df.head()

   client_id  birth_number  district_id
0          1        706213           18
1          2        450204            1
2          3        406009            1
3          4        561201            5
4          5        605703            5

In [5]:
client_df.dtypes

client_id       int64
birth_number    int64
district_id     int64
dtype: object

In [6]:
client_df['birth_number'] = client_df['birth_number'].astype('str')

In [7]:
client_df.dtypes

client_id        int64
birth_number    object
district_id      int64
dtype: object

In [8]:
client_df['sliced_birth'] = client_df['birth_number'].str.slice(0, 2)

In [9]:
client_df.head()

   client_id birth_number  district_id sliced_birth
0          1       706213           18           70
1          2       450204            1           45
2          3       406009            1           40
3          4       561201            5           56
4          5       605703            5           60

In [10]:
client_df['sliced_birth'] = client_df['sliced_birth'].astype(int)

In [12]:
def get_age(x):
    return 93 - x

In [13]:
client_df['age'] = client_df['sliced_birth'].apply(get_age)

In [14]:
client_df.head()

   client_id birth_number  district_id  sliced_birth  age
0          1       706213           18            70   23
1          2       450204            1            45   48
2          3       406009            1            40   53
3          4       561201            5            56   37
4          5       605703            5            60   33

In [18]:
client_df = client_df.drop(['birth_number', 'sliced_birth'], axis = 1)

In [19]:
client_df.head()

   client_id  district_id  age
0          1           18   23
1          2            1   48
2          3            1   53
3          4            5   37
4          5            5   33

In [25]:
# Write out to current working directory: 'C:\\Users\\15431\\Desktop'
client_df.to_csv('client_age.csv', encoding='utf-8', index=False)

In [26]:
# Check whether it is successful
client_age_df = pd.read_csv('client_age.csv')

In [27]:
client_age_df.head()

   client_id  district_id  age
0          1           18   23
1          2            1   48
2          3            1   53
3          4            5   37
4          5            5   33